## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: gcp/prod
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_service_account.cloud-dns will be read during apply
  # (config refers to values not yet known)
 <= data "google_service_account" "cloud-dns" {
+       account_id   = (known after apply)
+       display_name = (known after apply)
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       unique_id    = (known after apply)
    }

  # data.google_service_account.gke-external-dns will be read during apply
  # (config refers to values not yet known)
 <= data "google_service_account" "gke-external-dns" {
+       account_id   = (known after apply)
+       display_name = (known after apply)
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       unique_id    = (known after apply)
    }

  # data.kubernetes_secret.argocd-manager will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_secret" "argocd-manager" {
+       data      = (sensitive value)
+       id        = (known after apply)
+       immutable = (known after apply)
+       type      = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "argocd-manager"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # data.kubernetes_secret.argocd_admin will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_secret" "argocd_admin" {
+       data      = (sensitive value)
+       id        = (known after apply)
+       immutable = (known after apply)
+       type      = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "argocd-initial-admin-secret"
+           namespace        = "argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # data.kubernetes_secret.loadtesting-manager will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_secret" "loadtesting-manager" {
+       data      = (sensitive value)
+       id        = (known after apply)
+       immutable = (known after apply)
+       type      = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "loadtesting-manager"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # google_service_account_key.cloud-dns will be created
+   resource "google_service_account_key" "cloud-dns" {
+       id                 = (known after apply)
+       key_algorithm      = "KEY_ALG_RSA_2048"
+       name               = (known after apply)
+       private_key        = (sensitive value)
+       private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
+       public_key         = (known after apply)
+       public_key_type    = "TYPE_X509_PEM_FILE"
+       service_account_id = (known after apply)
+       valid_after        = (known after apply)
+       valid_before       = (known after apply)
    }

  # google_service_account_key.external-dns will be created
+   resource "google_service_account_key" "external-dns" {
+       id                 = (known after apply)
+       key_algorithm      = "KEY_ALG_RSA_2048"
+       name               = (known after apply)
+       private_key        = (sensitive value)
+       private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
+       public_key         = (known after apply)
+       public_key_type    = "TYPE_X509_PEM_FILE"
+       service_account_id = (known after apply)
+       valid_after        = (known after apply)
+       valid_before       = (known after apply)
    }

  # helm_release.argocd will be created
+   resource "helm_release" "argocd" {
+       atomic                     = false
+       chart                      = "argo-cd"
+       cleanup_on_fail            = true
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = true
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "argocd"
+       namespace                  = "argocd"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://argoproj.github.io/argo-helm"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           (sensitive),
+           <<-EOT
                "server":
                  "rbacConfig":
                    "policy.csv": |
                      g, autotune@contrasting.org, role:admin
                    "policy.default": "readOnly"
                    "scopes": "[email]"
            EOT,
        ]
+       verify                     = false
+       version                    = "5.1.0"
+       wait                       = true
+       wait_for_jobs              = false

+       set {
+           name  = "server.extraArgs"
+           value = "{--insecure}"
        }
    }

  # helm_release.cert-manager will be created
+   resource "helm_release" "cert-manager" {
+       atomic                     = false
+       chart                      = "cert-manager"
+       cleanup_on_fail            = false
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "cert-manager"
+       namespace                  = "cert-manager"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://charts.jetstack.io"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 120
+       verify                     = false
+       version                    = "v1.9.1"
+       wait                       = true
+       wait_for_jobs              = false

+       set {
+           name  = "createCustomResource"
+           value = "true"
        }
+       set {
+           name  = "installCRDs"
+           value = "true"
        }
    }

  # helm_release.cluster-issuer will be created
+   resource "helm_release" "cluster-issuer" {
+       atomic                     = false
+       chart                      = "../../charts/cluster-issuer"
+       cleanup_on_fail            = false
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "cluster-issuer"
+       namespace                  = "kube-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "0.2.4"
+       wait                       = true
+       wait_for_jobs              = false

+       set_sensitive {
+           name  = "zerossl-eab-hmac-key"
+           value = (sensitive value)
        }
+       set_sensitive {
+           name  = "zerossl-eab-hmac-key-id"
+           value = (sensitive value)
        }
+       set_sensitive {
+           name  = "zerossl_email"
+           value = (sensitive value)
        }
+       set_sensitive {
+           name  = "zerossl_gcp_cloud_dns_account"
+           value = (sensitive value)
        }
+       set_sensitive {
+           name  = "zerossl_gcp_project_id"
+           value = (sensitive value)
        }
    }

  # helm_release.external-dns will be created
+   resource "helm_release" "external-dns" {
+       atomic                     = false
+       chart                      = "external-dns"
+       cleanup_on_fail            = false
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "external-dns"
+       namespace                  = "external-dns"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://charts.bitnami.com/bitnami"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 120
+       verify                     = false
+       version                    = "6.9.0"
+       wait                       = true
+       wait_for_jobs              = false

+       set {
+           name  = "domainFilters"
+           value = "{wayofthesys.com}"
        }
+       set {
+           name  = "istio-ingress-gateway"
+           value = "istio-system/istio-ingressgateway"
        }
+       set {
+           name  = "provider"
+           value = "google"
        }
+       set {
+           name  = "rbac.create"
+           value = "true"
        }
+       set {
+           name  = "sources"
+           value = "{ingress,service,istio-gateway}"
        }

+       set_sensitive {
+           name  = "google.project"
+           value = (sensitive value)
        }
+       set_sensitive {
+           name  = "google.serviceAccountSecret"
+           value = (sensitive value)
        }
    }

  # helm_release.istio-base will be created
+   resource "helm_release" "istio-base" {
+       atomic                     = false
+       chart                      = "base"
+       cleanup_on_fail            = true
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = true
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "istio-base"
+       namespace                  = "istio-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://istio-release.storage.googleapis.com/charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "1.15.2"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # helm_release.istio-egress will be created
+   resource "helm_release" "istio-egress" {
+       atomic                     = false
+       chart                      = "gateway"
+       cleanup_on_fail            = true
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = true
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "istio-egressgateway"
+       namespace                  = "istio-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://istio-release.storage.googleapis.com/charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "1.15.2"
+       wait                       = true
+       wait_for_jobs              = false

+       set {
+           name  = "service.type"
+           value = "ClusterIP"
        }
    }

  # helm_release.istio-ingress will be created
+   resource "helm_release" "istio-ingress" {
+       atomic                     = false
+       chart                      = "gateway"
+       cleanup_on_fail            = true
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = true
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "istio-ingressgateway"
+       namespace                  = "istio-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://istio-release.storage.googleapis.com/charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "1.15.2"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # helm_release.istiod will be created
+   resource "helm_release" "istiod" {
+       atomic                     = false
+       chart                      = "istiod"
+       cleanup_on_fail            = true
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = true
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "istiod"
+       namespace                  = "istio-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://istio-release.storage.googleapis.com/charts"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       verify                     = false
+       version                    = "1.15.2"
+       wait                       = true
+       wait_for_jobs              = false

+       set {
+           name  = "grafana.enabled"
+           value = "true"
        }
+       set {
+           name  = "kiali.enabled"
+           value = "true"
        }
+       set {
+           name  = "meshConfig.accessLogFile"
+           value = "/dev/stdout"
        }
+       set {
+           name  = "servicegraph.enabled"
+           value = "true"
        }
+       set {
+           name  = "tracing.enabled"
+           value = "true"
        }
    }

  # kubernetes_annotations.cinema will be created
+   resource "kubernetes_annotations" "cinema" {
+       annotations = {
+           "mesh.cloud.google.com/proxy" = jsonencode(
                {
+                   managed = "true"
                }
            )
        }
+       api_version = "v1"
+       id          = (known after apply)
+       kind        = "Namespace"

+       metadata {
+           name = "cinema"
        }
    }

  # kubernetes_cluster_role.argocd-manager will be created
+   resource "kubernetes_cluster_role" "argocd-manager" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "argocd-manager-role"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       rule {
+           api_groups = [
+               "*",
            ]
+           resources  = [
+               "*",
            ]
+           verbs      = [
+               "*",
            ]
        }
+       rule {
+           non_resource_urls = [
+               "*",
            ]
+           verbs             = [
+               "*",
            ]
        }
    }

  # kubernetes_cluster_role.loadtesting-manager will be created
+   resource "kubernetes_cluster_role" "loadtesting-manager" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "loadtesting-manager-role"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       rule {
+           api_groups = [
+               "*",
            ]
+           resources  = [
+               "*",
            ]
+           verbs      = [
+               "*",
            ]
        }
+       rule {
+           non_resource_urls = [
+               "*",
            ]
+           verbs             = [
+               "*",
            ]
        }
    }

  # kubernetes_cluster_role_binding.argocd-manager will be created
+   resource "kubernetes_cluster_role_binding" "argocd-manager" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "argocd-manager-role-binding"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       role_ref {
+           api_group = "rbac.authorization.k8s.io"
+           kind      = "ClusterRole"
+           name      = "argocd-manager-role"
        }

+       subject {
+           api_group = (known after apply)
+           kind      = "ServiceAccount"
+           name      = "argocd-manager"
+           namespace = "kube-system"
        }
    }

  # kubernetes_cluster_role_binding.loadtesting-manager will be created
+   resource "kubernetes_cluster_role_binding" "loadtesting-manager" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "loadtesting-manager-role-binding"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }

+       role_ref {
+           api_group = "rbac.authorization.k8s.io"
+           kind      = "ClusterRole"
+           name      = "loadtesting-manager-role"
        }

+       subject {
+           api_group = (known after apply)
+           kind      = "ServiceAccount"
+           name      = "loadtesting-manager"
+           namespace = "kube-system"
        }
    }

  # kubernetes_labels.default-istio will be created
+   resource "kubernetes_labels" "default-istio" {
+       api_version = "v1"
+       id          = (known after apply)
+       kind        = "Namespace"
+       labels      = {
+           "istio.io/rev" = "asm-managed-regular"
        }

+       metadata {
+           name = "default"
        }
    }

  # kubernetes_namespace.argocd will be created
+   resource "kubernetes_namespace" "argocd" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_namespace.cert-manager will be created
+   resource "kubernetes_namespace" "cert-manager" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "istio.io/rev" = "asm-managed-regular"
            }
+           name             = "cert-manager"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_namespace.cinema will be created
+   resource "kubernetes_namespace" "cinema" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "cinema"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_namespace.external-dns will be created
+   resource "kubernetes_namespace" "external-dns" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "external-dns"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_namespace.istio-egress will be created
+   resource "kubernetes_namespace" "istio-egress" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "istio-injection" = "enabled"
            }
+           name             = "istio-egress"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_namespace.istio-ingress will be created
+   resource "kubernetes_namespace" "istio-ingress" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "istio-injection" = "enabled"
            }
+           name             = "istio-ingress"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_namespace.istio-system will be created
+   resource "kubernetes_namespace" "istio-system" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "istio-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_namespace.locust will be created
+   resource "kubernetes_namespace" "locust" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "loadtesting"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_namespace.robusta will be created
+   resource "kubernetes_namespace" "robusta" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "robusta"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.argocd-manager will be created
+   resource "kubernetes_secret" "argocd-manager" {
+       data                           = (sensitive value)
+       id                             = (known after apply)
+       type                           = "kubernetes.io/service-account-token"
+       wait_for_service_account_token = true

+       metadata {
+           annotations      = {
+               "kubernetes.io/service-account.name" = "argocd-manager"
            }
+           generation       = (known after apply)
+           name             = "argocd-manager"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.argocd-tls will be created
+   resource "kubernetes_secret" "argocd-tls" {
+       data                           = (sensitive value)
+       id                             = (known after apply)
+       type                           = "tls"
+       wait_for_service_account_token = true

+       metadata {
+           generation       = (known after apply)
+           name             = "argocd-tls"
+           namespace        = "istio-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.cloud-dns-credentials will be created
+   resource "kubernetes_secret" "cloud-dns-credentials" {
+       data                           = (sensitive value)
+       id                             = (known after apply)
+       type                           = "kubernetes.io/opaque"
+       wait_for_service_account_token = true

+       metadata {
+           generation       = (known after apply)
+           name             = "gke-cloud-dns"
+           namespace        = "cert-manager"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.docker_login_secret will be created
+   resource "kubernetes_secret" "docker_login_secret" {
+       data                           = (sensitive value)
+       id                             = (known after apply)
+       type                           = "kubernetes.io/dockerconfigjson"
+       wait_for_service_account_token = true

+       metadata {
+           generation       = (known after apply)
+           name             = "docker-login"
+           namespace        = "cinema"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.external-dns-credentials will be created
+   resource "kubernetes_secret" "external-dns-credentials" {
+       data                           = (sensitive value)
+       id                             = (known after apply)
+       type                           = "kubernetes.io/opaque"
+       wait_for_service_account_token = true

+       metadata {
+           generation       = (known after apply)
+           name             = "external-dns"
+           namespace        = "external-dns"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.loadtesting-manager will be created
+   resource "kubernetes_secret" "loadtesting-manager" {
+       data                           = (sensitive value)
+       id                             = (known after apply)
+       type                           = "kubernetes.io/service-account-token"
+       wait_for_service_account_token = true

+       metadata {
+           annotations      = {
+               "kubernetes.io/service-account.name" = "loadtesting-manager"
            }
+           generation       = (known after apply)
+           name             = "loadtesting-manager"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.mongodb-auth will be created
+   resource "kubernetes_secret" "mongodb-auth" {
+       data                           = (sensitive value)
+       id                             = (known after apply)
+       type                           = "kubernetes.io/opaque"
+       wait_for_service_account_token = true

+       metadata {
+           generation       = (known after apply)
+           name             = "mongodb-auth"
+           namespace        = "cinema"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.wayofthesys-tls will be created
+   resource "kubernetes_secret" "wayofthesys-tls" {
+       data                           = (sensitive value)
+       id                             = (known after apply)
+       type                           = "Opaque"
+       wait_for_service_account_token = true

+       metadata {
+           generation       = (known after apply)
+           name             = "wayofthesys-com-tls"
+           namespace        = "cinema"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.zerossl-eab-hmac-key will be created
+   resource "kubernetes_secret" "zerossl-eab-hmac-key" {
+       data                           = (sensitive value)
+       id                             = (known after apply)
+       type                           = "kubernetes.io/opaque"
+       wait_for_service_account_token = true

+       metadata {
+           generation       = (known after apply)
+           name             = "zerossl-eab-hmac-key"
+           namespace        = "cert-manager"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.zerossl-eab-hmac-key-id will be created
+   resource "kubernetes_secret" "zerossl-eab-hmac-key-id" {
+       data                           = (sensitive value)
+       id                             = (known after apply)
+       type                           = "kubernetes.io/opaque"
+       wait_for_service_account_token = true

+       metadata {
+           generation       = (known after apply)
+           name             = "zerossl-eab-hmac-key-id"
+           namespace        = "cert-manager"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_service_account.argocd-manager will be created
+   resource "kubernetes_service_account" "argocd-manager" {
+       automount_service_account_token = true
+       default_secret_name             = (known after apply)
+       id                              = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "argocd-manager"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_service_account.loadtesting-manager will be created
+   resource "kubernetes_service_account" "loadtesting-manager" {
+       automount_service_account_token = true
+       default_secret_name             = (known after apply)
+       id                              = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "loadtesting-manager"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.gke-cinema.data.google_compute_zones.available will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_compute_zones" "available" {
+       id      = (known after apply)
+       names   = (known after apply)
+       project = "wayofthesys-cinema-363715"
+       region  = "us-central1"
    }

  # module.gke-cinema.data.google_container_engine_versions.region will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_engine_versions" "region" {
+       default_cluster_version         = (known after apply)
+       id                              = (known after apply)
+       latest_master_version           = (known after apply)
+       latest_node_version             = (known after apply)
+       location                        = "us-central1"
+       project                         = "wayofthesys-cinema-363715"
+       release_channel_default_version = (known after apply)
+       valid_master_versions           = (known after apply)
+       valid_node_versions             = (known after apply)
    }

  # module.gke-cinema.data.google_container_engine_versions.zone will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_engine_versions" "zone" {
+       default_cluster_version         = (known after apply)
+       id                              = (known after apply)
+       latest_master_version           = (known after apply)
+       latest_node_version             = (known after apply)
+       location                        = "us-central1-a"
+       project                         = "wayofthesys-cinema-363715"
+       release_channel_default_version = (known after apply)
+       valid_master_versions           = (known after apply)
+       valid_node_versions             = (known after apply)
    }

  # module.gke-cinema.google_container_cluster.primary will be created
+   resource "google_container_cluster" "primary" {
+       cluster_ipv4_cidr           = (known after apply)
+       datapath_provider           = (known after apply)
+       default_max_pods_per_node   = 65
+       enable_binary_authorization = false
+       enable_intranode_visibility = (known after apply)
+       enable_kubernetes_alpha     = false
+       enable_legacy_abac          = false
+       enable_shielded_nodes       = true
+       endpoint                    = (known after apply)
+       id                          = (known after apply)
+       label_fingerprint           = (known after apply)
+       location                    = "us-central1"
+       logging_service             = "logging.googleapis.com/kubernetes"
+       master_version              = (known after apply)
+       min_master_version          = (known after apply)
+       monitoring_service          = "monitoring.googleapis.com/kubernetes"
+       name                        = "cinema"
+       network                     = "projects/wayofthesys-cinema-363715/global/networks/cinema"
+       networking_mode             = (known after apply)
+       node_locations              = [
+           "us-central1-a",
        ]
+       node_version                = (known after apply)
+       operation                   = (known after apply)
+       private_ipv6_google_access  = (known after apply)
+       project                     = "wayofthesys-cinema-363715"
+       remove_default_node_pool    = true
+       resource_labels             = {
+           "mesh_id" = "proj-835403465390"
        }
+       self_link                   = (known after apply)
+       services_ipv4_cidr          = (known after apply)
+       subnetwork                  = "projects/wayofthesys-cinema-363715/regions/us-central1/subnetworks/prod"
+       tpu_ipv4_cidr_block         = (known after apply)

+       addons_config {
+           cloudrun_config {
+               disabled           = (known after apply)
+               load_balancer_type = (known after apply)
            }

+           dns_cache_config {
+               enabled = false
            }

+           gce_persistent_disk_csi_driver_config {
+               enabled = (known after apply)
            }

+           gcp_filestore_csi_driver_config {
+               enabled = false
            }

+           horizontal_pod_autoscaling {
+               disabled = false
            }

+           http_load_balancing {
+               disabled = false
            }

+           network_policy_config {
+               disabled = true
            }
        }

+       authenticator_groups_config {
+           security_group = (known after apply)
        }

+       cluster_autoscaling {
+           enabled = false

+           auto_provisioning_defaults {
+               boot_disk_kms_key = (known after apply)
+               image_type        = (known after apply)
+               oauth_scopes      = (known after apply)
+               service_account   = (known after apply)
            }
        }

+       confidential_nodes {
+           enabled = (known after apply)
        }

+       database_encryption {
+           state = "DECRYPTED"
        }

+       default_snat_status {
+           disabled = false
        }

+       ip_allocation_policy {
+           cluster_ipv4_cidr_block       = (known after apply)
+           cluster_secondary_range_name  = "us-central1-01-gke-01-pods"
+           services_ipv4_cidr_block      = (known after apply)
+           services_secondary_range_name = "us-central1-01-gke-01-services"
        }

+       logging_config {
+           enable_components = (known after apply)
        }

+       maintenance_policy {
+           daily_maintenance_window {
+               duration   = (known after apply)
+               start_time = "05:00"
            }
        }

+       master_auth {
+           client_certificate     = (known after apply)
+           client_key             = (sensitive value)
+           cluster_ca_certificate = (known after apply)

+           client_certificate_config {
+               issue_client_certificate = false
            }
        }

+       mesh_certificates {
+           enable_certificates = (known after apply)
        }

+       monitoring_config {
+           enable_components = (known after apply)
        }

+       network_policy {
+           enabled = false
        }

+       node_config {
+           boot_disk_kms_key = (known after apply)
+           disk_size_gb      = (known after apply)
+           disk_type         = (known after apply)
+           guest_accelerator = (known after apply)
+           image_type        = (known after apply)
+           labels            = (known after apply)
+           local_ssd_count   = (known after apply)
+           machine_type      = (known after apply)
+           metadata          = (known after apply)
+           min_cpu_platform  = (known after apply)
+           node_group        = (known after apply)
+           oauth_scopes      = (known after apply)
+           preemptible       = (known after apply)
+           service_account   = (known after apply)
+           spot              = (known after apply)
+           tags              = (known after apply)
+           taint             = (known after apply)

+           gcfs_config {
+               enabled = (known after apply)
            }

+           gvnic {
+               enabled = (known after apply)
            }

+           reservation_affinity {
+               consume_reservation_type = (known after apply)
+               key                      = (known after apply)
+               values                   = (known after apply)
            }

+           shielded_instance_config {
+               enable_integrity_monitoring = (known after apply)
+               enable_secure_boot          = (known after apply)
            }

+           workload_metadata_config {
+               mode = (known after apply)
            }
        }

+       node_pool {
+           initial_node_count          = 0
+           instance_group_urls         = (known after apply)
+           managed_instance_group_urls = (known after apply)
+           max_pods_per_node           = (known after apply)
+           name                        = "default-pool"
+           name_prefix                 = (known after apply)
+           node_count                  = (known after apply)
+           node_locations              = (known after apply)
+           version                     = (known after apply)

+           management {
+               auto_repair  = (known after apply)
+               auto_upgrade = (known after apply)
            }

+           node_config {
+               disk_size_gb      = (known after apply)
+               disk_type         = (known after apply)
+               guest_accelerator = (known after apply)
+               image_type        = "COS_CONTAINERD"
+               labels            = (known after apply)
+               local_ssd_count   = (known after apply)
+               machine_type      = "n2-highmem-8"
+               metadata          = (known after apply)
+               min_cpu_platform  = (known after apply)
+               oauth_scopes      = (known after apply)
+               preemptible       = false
+               service_account   = "terrateam-tf@wayofthesys-cinema-363715.iam.gserviceaccount.com"
+               spot              = false
+               tags              = [
+                   "gke-cinema",
+                   "gke-cinema-default-pool",
                ]
+               taint             = (known after apply)

+               shielded_instance_config {
+                   enable_integrity_monitoring = true
+                   enable_secure_boot          = false
                }

+               workload_metadata_config {
+                   mode = "GKE_METADATA"
                }
            }

+           upgrade_settings {
+               max_surge       = (known after apply)
+               max_unavailable = (known after apply)
            }
        }

+       notification_config {
+           pubsub {
+               enabled = false
            }
        }

+       release_channel {
+           channel = (known after apply)
        }

+       service_external_ips_config {
+           enabled = (known after apply)
        }

+       timeouts {
+           create = "45m"
+           delete = "45m"
+           update = "45m"
        }

+       vertical_pod_autoscaling {
+           enabled = false
        }

+       workload_identity_config {
+           workload_pool = "wayofthesys-cinema-363715.svc.id.goog"
        }
    }

  # module.gke-cinema.google_container_node_pool.pools["core"] will be created
+   resource "google_container_node_pool" "pools" {
+       cluster                     = "cinema"
+       id                          = (known after apply)
+       initial_node_count          = 4
+       instance_group_urls         = (known after apply)
+       location                    = "us-central1"
+       managed_instance_group_urls = (known after apply)
+       max_pods_per_node           = (known after apply)
+       name                        = "core"
+       name_prefix                 = (known after apply)
+       node_count                  = (known after apply)
+       node_locations              = [
+           "us-central1-a",
        ]
+       operation                   = (known after apply)
+       project                     = "wayofthesys-cinema-363715"
+       version                     = (known after apply)

+       autoscaling {
+           max_node_count = 8
+           min_node_count = 4
        }

+       management {
+           auto_repair  = true
+           auto_upgrade = true
        }

+       node_config {
+           disk_size_gb      = 20
+           disk_type         = "pd-standard"
+           guest_accelerator = []
+           image_type        = "COS_CONTAINERD"
+           labels            = {
+               "cluster_name" = "cinema"
+               "node_pool"    = "core"
            }
+           local_ssd_count   = 1
+           machine_type      = "n2-highmem-8"
+           metadata          = {
+               "cluster_name"             = "cinema"
+               "disable-legacy-endpoints" = "true"
+               "node_pool"                = "core"
            }
+           min_cpu_platform  = (known after apply)
+           oauth_scopes      = [
+               "https://www.googleapis.com/auth/logging.write",
+               "https://www.googleapis.com/auth/monitoring",
            ]
+           preemptible       = true
+           service_account   = "terrateam-tf@wayofthesys-cinema-363715.iam.gserviceaccount.com"
+           spot              = false
+           tags              = [
+               "gke-cinema",
+               "gke-cinema-core",
            ]
+           taint             = (known after apply)

+           shielded_instance_config {
+               enable_integrity_monitoring = true
+               enable_secure_boot          = false
            }

+           workload_metadata_config {
+               mode = "GKE_METADATA"
            }
        }

+       timeouts {
+           create = "45m"
+           delete = "45m"
+           update = "45m"
        }

+       upgrade_settings {
+           max_surge       = 1
+           max_unavailable = 0
        }
    }

  # module.gke-cinema.google_project_iam_member.cluster_service_account-log_writer[0] will be created
+   resource "google_project_iam_member" "cluster_service_account-log_writer" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "wayofthesys-cinema-363715"
+       role    = "roles/logging.logWriter"
    }

  # module.gke-cinema.google_project_iam_member.cluster_service_account-metric_writer[0] will be created
+   resource "google_project_iam_member" "cluster_service_account-metric_writer" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "wayofthesys-cinema-363715"
+       role    = "roles/monitoring.metricWriter"
    }

  # module.gke-cinema.google_project_iam_member.cluster_service_account-monitoring_viewer[0] will be created
+   resource "google_project_iam_member" "cluster_service_account-monitoring_viewer" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "wayofthesys-cinema-363715"
+       role    = "roles/monitoring.viewer"
    }

  # module.gke-cinema.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0] will be created
+   resource "google_project_iam_member" "cluster_service_account-resourceMetadata-writer" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "wayofthesys-cinema-363715"
+       role    = "roles/stackdriver.resourceMetadata.writer"
    }

  # module.gke-cinema.google_service_account.cluster_service_account[0] will be created
+   resource "google_service_account" "cluster_service_account" {
+       account_id   = (known after apply)
+       disabled     = false
+       display_name = "Terraform-managed service account for cluster cinema"
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       project      = "wayofthesys-cinema-363715"
+       unique_id    = (known after apply)
    }

  # module.gke-cinema.random_shuffle.available_zones will be created
+   resource "random_shuffle" "available_zones" {
+       id           = (known after apply)
+       input        = (known after apply)
+       result       = (known after apply)
+       result_count = 3
    }

  # module.gke-cinema.random_string.cluster_service_account_suffix will be created
+   resource "random_string" "cluster_service_account_suffix" {
+       id          = (known after apply)
+       length      = 4
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.gke-loadtesting.data.google_compute_zones.available will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_compute_zones" "available" {
+       id      = (known after apply)
+       names   = (known after apply)
+       project = "wayofthesys-cinema-363715"
+       region  = "us-central1"
    }

  # module.gke-loadtesting.data.google_container_engine_versions.region will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_engine_versions" "region" {
+       default_cluster_version         = (known after apply)
+       id                              = (known after apply)
+       latest_master_version           = (known after apply)
+       latest_node_version             = (known after apply)
+       location                        = "us-central1"
+       project                         = "wayofthesys-cinema-363715"
+       release_channel_default_version = (known after apply)
+       valid_master_versions           = (known after apply)
+       valid_node_versions             = (known after apply)
    }

  # module.gke-loadtesting.data.google_container_engine_versions.zone will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_engine_versions" "zone" {
+       default_cluster_version         = (known after apply)
+       id                              = (known after apply)
+       latest_master_version           = (known after apply)
+       latest_node_version             = (known after apply)
+       location                        = "us-central1-a"
+       project                         = "wayofthesys-cinema-363715"
+       release_channel_default_version = (known after apply)
+       valid_master_versions           = (known after apply)
+       valid_node_versions             = (known after apply)
    }

  # module.gke-loadtesting.google_container_cluster.primary will be created
+   resource "google_container_cluster" "primary" {
+       cluster_ipv4_cidr           = (known after apply)
+       datapath_provider           = (known after apply)
+       default_max_pods_per_node   = 65
+       enable_binary_authorization = false
+       enable_intranode_visibility = (known after apply)
+       enable_kubernetes_alpha     = false
+       enable_legacy_abac          = false
+       enable_shielded_nodes       = true
+       endpoint                    = (known after apply)
+       id                          = (known after apply)
+       label_fingerprint           = (known after apply)
+       location                    = "us-central1"
+       logging_service             = "logging.googleapis.com/kubernetes"
+       master_version              = (known after apply)
+       min_master_version          = (known after apply)
+       monitoring_service          = "monitoring.googleapis.com/kubernetes"
+       name                        = "loadtesting"
+       network                     = "projects/wayofthesys-cinema-363715/global/networks/loadtesting"
+       networking_mode             = (known after apply)
+       node_locations              = [
+           "us-central1-a",
        ]
+       node_version                = (known after apply)
+       operation                   = (known after apply)
+       private_ipv6_google_access  = (known after apply)
+       project                     = "wayofthesys-cinema-363715"
+       remove_default_node_pool    = true
+       resource_labels             = {
+           "mesh_id" = "proj-835403465390"
        }
+       self_link                   = (known after apply)
+       services_ipv4_cidr          = (known after apply)
+       subnetwork                  = "projects/wayofthesys-cinema-363715/regions/us-central1/subnetworks/loadtesting"
+       tpu_ipv4_cidr_block         = (known after apply)

+       addons_config {
+           cloudrun_config {
+               disabled           = (known after apply)
+               load_balancer_type = (known after apply)
            }

+           dns_cache_config {
+               enabled = false
            }

+           gce_persistent_disk_csi_driver_config {
+               enabled = (known after apply)
            }

+           gcp_filestore_csi_driver_config {
+               enabled = false
            }

+           horizontal_pod_autoscaling {
+               disabled = false
            }

+           http_load_balancing {
+               disabled = false
            }

+           network_policy_config {
+               disabled = true
            }
        }

+       authenticator_groups_config {
+           security_group = (known after apply)
        }

+       cluster_autoscaling {
+           enabled = false

+           auto_provisioning_defaults {
+               boot_disk_kms_key = (known after apply)
+               image_type        = (known after apply)
+               oauth_scopes      = (known after apply)
+               service_account   = (known after apply)
            }
        }

+       confidential_nodes {
+           enabled = (known after apply)
        }

+       database_encryption {
+           state = "DECRYPTED"
        }

+       default_snat_status {
+           disabled = false
        }

+       ip_allocation_policy {
+           cluster_ipv4_cidr_block       = (known after apply)
+           cluster_secondary_range_name  = "us-central1-01-gke-02-pods"
+           services_ipv4_cidr_block      = (known after apply)
+           services_secondary_range_name = "us-central1-01-gke-02-services"
        }

+       logging_config {
+           enable_components = (known after apply)
        }

+       maintenance_policy {
+           daily_maintenance_window {
+               duration   = (known after apply)
+               start_time = "05:00"
            }
        }

+       master_auth {
+           client_certificate     = (known after apply)
+           client_key             = (sensitive value)
+           cluster_ca_certificate = (known after apply)

+           client_certificate_config {
+               issue_client_certificate = false
            }
        }

+       mesh_certificates {
+           enable_certificates = (known after apply)
        }

+       monitoring_config {
+           enable_components = (known after apply)
        }

+       network_policy {
+           enabled = false
        }

+       node_config {
+           boot_disk_kms_key = (known after apply)
+           disk_size_gb      = (known after apply)
+           disk_type         = (known after apply)
+           guest_accelerator = (known after apply)
+           image_type        = (known after apply)
+           labels            = (known after apply)
+           local_ssd_count   = (known after apply)
+           machine_type      = (known after apply)
+           metadata          = (known after apply)
+           min_cpu_platform  = (known after apply)
+           node_group        = (known after apply)
+           oauth_scopes      = (known after apply)
+           preemptible       = (known after apply)
+           service_account   = (known after apply)
+           spot              = (known after apply)
+           tags              = (known after apply)
+           taint             = (known after apply)

+           gcfs_config {
+               enabled = (known after apply)
            }

+           gvnic {
+               enabled = (known after apply)
            }

+           reservation_affinity {
+               consume_reservation_type = (known after apply)
+               key                      = (known after apply)
+               values                   = (known after apply)
            }

+           shielded_instance_config {
+               enable_integrity_monitoring = (known after apply)
+               enable_secure_boot          = (known after apply)
            }

+           workload_metadata_config {
+               mode = (known after apply)
            }
        }

+       node_pool {
+           initial_node_count          = 0
+           instance_group_urls         = (known after apply)
+           managed_instance_group_urls = (known after apply)
+           max_pods_per_node           = (known after apply)
+           name                        = "default-pool"
+           name_prefix                 = (known after apply)
+           node_count                  = (known after apply)
+           node_locations              = (known after apply)
+           version                     = (known after apply)

+           management {
+               auto_repair  = (known after apply)
+               auto_upgrade = (known after apply)
            }

+           node_config {
+               disk_size_gb      = (known after apply)
+               disk_type         = (known after apply)
+               guest_accelerator = (known after apply)
+               image_type        = "COS_CONTAINERD"
+               labels            = (known after apply)
+               local_ssd_count   = (known after apply)
+               machine_type      = "n2-highcpu-4"
+               metadata          = (known after apply)
+               min_cpu_platform  = (known after apply)
+               oauth_scopes      = (known after apply)
+               preemptible       = false
+               service_account   = "terrateam-tf@wayofthesys-cinema-363715.iam.gserviceaccount.com"
+               spot              = false
+               tags              = [
+                   "gke-loadtesting",
+                   "gke-loadtesting-default-pool",
                ]
+               taint             = (known after apply)

+               shielded_instance_config {
+                   enable_integrity_monitoring = true
+                   enable_secure_boot          = false
                }

+               workload_metadata_config {
+                   mode = "GKE_METADATA"
                }
            }

+           upgrade_settings {
+               max_surge       = (known after apply)
+               max_unavailable = (known after apply)
            }
        }

+       notification_config {
+           pubsub {
+               enabled = false
            }
        }

+       release_channel {
+           channel = (known after apply)
        }

+       service_external_ips_config {
+           enabled = (known after apply)
        }

+       timeouts {
+           create = "45m"
+           delete = "45m"
+           update = "45m"
        }

+       vertical_pod_autoscaling {
+           enabled = false
        }

+       workload_identity_config {
+           workload_pool = "wayofthesys-cinema-363715.svc.id.goog"
        }
    }

  # module.gke-loadtesting.google_container_node_pool.pools["core"] will be created
+   resource "google_container_node_pool" "pools" {
+       cluster                     = "loadtesting"
+       id                          = (known after apply)
+       initial_node_count          = 1
+       instance_group_urls         = (known after apply)
+       location                    = "us-central1"
+       managed_instance_group_urls = (known after apply)
+       max_pods_per_node           = (known after apply)
+       name                        = "core"
+       name_prefix                 = (known after apply)
+       node_count                  = (known after apply)
+       node_locations              = [
+           "us-central1-a",
        ]
+       operation                   = (known after apply)
+       project                     = "wayofthesys-cinema-363715"
+       version                     = (known after apply)

+       autoscaling {
+           max_node_count = 3
+           min_node_count = 1
        }

+       management {
+           auto_repair  = true
+           auto_upgrade = true
        }

+       node_config {
+           disk_size_gb      = 20
+           disk_type         = "pd-standard"
+           guest_accelerator = []
+           image_type        = "COS_CONTAINERD"
+           labels            = {
+               "cluster_name" = "loadtesting"
+               "node_pool"    = "core"
            }
+           local_ssd_count   = 1
+           machine_type      = "n2-highcpu-4"
+           metadata          = {
+               "cluster_name"             = "loadtesting"
+               "disable-legacy-endpoints" = "true"
+               "node_pool"                = "core"
            }
+           min_cpu_platform  = (known after apply)
+           oauth_scopes      = [
+               "https://www.googleapis.com/auth/logging.write",
+               "https://www.googleapis.com/auth/monitoring",
            ]
+           preemptible       = true
+           service_account   = "terrateam-tf@wayofthesys-cinema-363715.iam.gserviceaccount.com"
+           spot              = false
+           tags              = [
+               "gke-loadtesting",
+               "gke-loadtesting-core",
            ]
+           taint             = (known after apply)

+           shielded_instance_config {
+               enable_integrity_monitoring = true
+               enable_secure_boot          = false
            }

+           workload_metadata_config {
+               mode = "GKE_METADATA"
            }
        }

+       timeouts {
+           create = "45m"
+           delete = "45m"
+           update = "45m"
        }

+       upgrade_settings {
+           max_surge       = 1
+           max_unavailable = 0
        }
    }

  # module.gke-loadtesting.google_project_iam_member.cluster_service_account-log_writer[0] will be created
+   resource "google_project_iam_member" "cluster_service_account-log_writer" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "wayofthesys-cinema-363715"
+       role    = "roles/logging.logWriter"
    }

  # module.gke-loadtesting.google_project_iam_member.cluster_service_account-metric_writer[0] will be created
+   resource "google_project_iam_member" "cluster_service_account-metric_writer" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "wayofthesys-cinema-363715"
+       role    = "roles/monitoring.metricWriter"
    }

  # module.gke-loadtesting.google_project_iam_member.cluster_service_account-monitoring_viewer[0] will be created
+   resource "google_project_iam_member" "cluster_service_account-monitoring_viewer" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "wayofthesys-cinema-363715"
+       role    = "roles/monitoring.viewer"
    }

  # module.gke-loadtesting.google_project_iam_member.cluster_service_account-resourceMetadata-writer[0] will be created
+   resource "google_project_iam_member" "cluster_service_account-resourceMetadata-writer" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "wayofthesys-cinema-363715"
+       role    = "roles/stackdriver.resourceMetadata.writer"
    }

  # module.gke-loadtesting.google_service_account.cluster_service_account[0] will be created
+   resource "google_service_account" "cluster_service_account" {
+       account_id   = (known after apply)
+       disabled     = false
+       display_name = "Terraform-managed service account for cluster loadtesting"
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       project      = "wayofthesys-cinema-363715"
+       unique_id    = (known after apply)
    }

  # module.gke-loadtesting.random_shuffle.available_zones will be created
+   resource "random_shuffle" "available_zones" {
+       id           = (known after apply)
+       input        = (known after apply)
+       result       = (known after apply)
+       result_count = 3
    }

  # module.gke-loadtesting.random_string.cluster_service_account_suffix will be created
+   resource "random_string" "cluster_service_account_suffix" {
+       id          = (known after apply)
+       length      = 4
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.cloud-dns.module.iam.google_service_account_iam_binding.service_account_iam_authoritative["default--roles/iam.workloadIdentityUser"] will be created
+   resource "google_service_account_iam_binding" "service_account_iam_authoritative" {
+       etag               = (known after apply)
+       id                 = (known after apply)
+       members            = (known after apply)
+       role               = (known after apply)
+       service_account_id = (known after apply)

+       condition {
+           description = (known after apply)
+           expression  = (known after apply)
+           title       = (known after apply)
        }
    }

  # module.cloud-dns.module.service_account.google_project_iam_member.project-roles["cloud-dns-wayofthesys-cinema-363715=>roles/dns.admin"] will be created
+   resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "wayofthesys-cinema-363715"
+       role    = "roles/dns.admin"
    }

  # module.cloud-dns.module.service_account.google_service_account.service_accounts["cloud-dns"] will be created
+   resource "google_service_account" "service_accounts" {
+       account_id   = "cloud-dns"
+       disabled     = false
+       display_name = "Terraform-managed service account"
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       project      = "wayofthesys-cinema-363715"
+       unique_id    = (known after apply)
    }

  # module.external-dns.module.iam.google_service_account_iam_binding.service_account_iam_authoritative["default--roles/iam.workloadIdentityUser"] will be created
+   resource "google_service_account_iam_binding" "service_account_iam_authoritative" {
+       etag               = (known after apply)
+       id                 = (known after apply)
+       members            = (known after apply)
+       role               = (known after apply)
+       service_account_id = (known after apply)

+       condition {
+           description = (known after apply)
+           expression  = (known after apply)
+           title       = (known after apply)
        }
    }

  # module.external-dns.module.service_account.google_project_iam_member.project-roles["external-dns-wayofthesys-cinema-363715=>roles/dns.admin"] will be created
+   resource "google_project_iam_member" "project-roles" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "wayofthesys-cinema-363715"
+       role    = "roles/dns.admin"
    }

  # module.external-dns.module.service_account.google_service_account.service_accounts["external-dns"] will be created
+   resource "google_service_account" "service_accounts" {
+       account_id   = "external-dns"
+       disabled     = false
+       display_name = "Terraform-managed service account"
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       project      = "wayofthesys-cinema-363715"
+       unique_id    = (known after apply)
    }

  # module.vpc-cinema.module.routes.google_compute_route.route["egress-internet"] will be created
+   resource "google_compute_route" "route" {
+       description            = "route through IGW to access internet"
+       dest_range             = "0.0.0.0/0"
+       id                     = (known after apply)
+       name                   = "egress-internet"
+       network                = "cinema"
+       next_hop_gateway       = "default-internet-gateway"
+       next_hop_instance_zone = (known after apply)
+       next_hop_ip            = (known after apply)
+       next_hop_network       = (known after apply)
+       priority               = 1000
+       project                = "wayofthesys-cinema-363715"
+       self_link              = (known after apply)
+       tags                   = [
+           "egress-inet",
        ]
    }

  # module.vpc-cinema.module.subnets.google_compute_subnetwork.subnetwork["us-central1/prod"] will be created
+   resource "google_compute_subnetwork" "subnetwork" {
+       creation_timestamp         = (known after apply)
+       external_ipv6_prefix       = (known after apply)
+       fingerprint                = (known after apply)
+       gateway_address            = (known after apply)
+       id                         = (known after apply)
+       ip_cidr_range              = "10.1.0.0/16"
+       ipv6_cidr_range            = (known after apply)
+       name                       = "prod"
+       network                    = "cinema"
+       private_ip_google_access   = false
+       private_ipv6_google_access = (known after apply)
+       project                    = "wayofthesys-cinema-363715"
+       purpose                    = (known after apply)
+       region                     = "us-central1"
+       secondary_ip_range         = [
+           {
+               ip_cidr_range = "10.4.0.0/16"
+               range_name    = "us-central1-01-gke-01-pods"
            },
+           {
+               ip_cidr_range = "10.8.0.0/16"
+               range_name    = "us-central1-01-gke-01-services"
            },
        ]
+       self_link                  = (known after apply)
+       stack_type                 = (known after apply)
    }

  # module.vpc-cinema.module.vpc.google_compute_network.network will be created
+   resource "google_compute_network" "network" {
+       auto_create_subnetworks         = false
+       delete_default_routes_on_create = false
+       gateway_ipv4                    = (known after apply)
+       id                              = (known after apply)
+       internal_ipv6_range             = (known after apply)
+       mtu                             = 0
+       name                            = "cinema"
+       project                         = "wayofthesys-cinema-363715"
+       routing_mode                    = "GLOBAL"
+       self_link                       = (known after apply)
    }

  # module.vpc-loadtesting.module.routes.google_compute_route.route["egress-internet-loadtesting"] will be created
+   resource "google_compute_route" "route" {
+       description            = "route through IGW to access internet"
+       dest_range             = "0.0.0.0/0"
+       id                     = (known after apply)
+       name                   = "egress-internet-loadtesting"
+       network                = "loadtesting"
+       next_hop_gateway       = "default-internet-gateway"
+       next_hop_instance_zone = (known after apply)
+       next_hop_ip            = (known after apply)
+       next_hop_network       = (known after apply)
+       priority               = 1000
+       project                = "wayofthesys-cinema-363715"
+       self_link              = (known after apply)
+       tags                   = [
+           "egress-inet",
        ]
    }

  # module.vpc-loadtesting.module.subnets.google_compute_subnetwork.subnetwork["us-central1/loadtesting"] will be created
+   resource "google_compute_subnetwork" "subnetwork" {
+       creation_timestamp         = (known after apply)
+       external_ipv6_prefix       = (known after apply)
+       fingerprint                = (known after apply)
+       gateway_address            = (known after apply)
+       id                         = (known after apply)
+       ip_cidr_range              = "10.2.0.0/16"
+       ipv6_cidr_range            = (known after apply)
+       name                       = "loadtesting"
+       network                    = "loadtesting"
+       private_ip_google_access   = false
+       private_ipv6_google_access = (known after apply)
+       project                    = "wayofthesys-cinema-363715"
+       purpose                    = (known after apply)
+       region                     = "us-central1"
+       secondary_ip_range         = [
+           {
+               ip_cidr_range = "10.3.0.0/16"
+               range_name    = "us-central1-01-gke-02-pods"
            },
+           {
+               ip_cidr_range = "10.9.0.0/16"
+               range_name    = "us-central1-01-gke-02-services"
            },
        ]
+       self_link                  = (known after apply)
+       stack_type                 = (known after apply)
    }

  # module.vpc-loadtesting.module.vpc.google_compute_network.network will be created
+   resource "google_compute_network" "network" {
+       auto_create_subnetworks         = false
+       delete_default_routes_on_create = false
+       gateway_ipv4                    = (known after apply)
+       id                              = (known after apply)
+       internal_ipv6_range             = (known after apply)
+       mtu                             = 0
+       name                            = "loadtesting"
+       project                         = "wayofthesys-cinema-363715"
+       routing_mode                    = "GLOBAL"
+       self_link                       = (known after apply)
    }

Plan: 67 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   project = "wayofthesys-cinema-363715"

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:gcp/prod workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 635.76 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| gcp/prod | default | 0.00 | 635.76 | 635.76|
| | **Total** | **0.00** | **635.76** | **635.76** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
